Тест1/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитТелефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Область</name>
    <type>
      <types>CatalogRef.Область</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город2</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна2</name>
    <type>
      <types>CatalogRef.Страна</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>EnumRef.ТипыПродукцииПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.дт_ТипыКлиентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Машины</name>
    <attributes>
      <name>Машина</name>
      <type>
        <types>CatalogRef.МашиныКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеКонтакты</name>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительно</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Catalogs/Контрагенты/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает значения реквизитов выбранного контрагента.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Ссылка на контрагента
//
// Возвращаемое значение:
//  Структура - реквизиты выбранного контрагента
//
Функция РеквизитыКонтрагента(Контрагент) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Спр.ПолноеНаименование КАК СТРОКА(255)) КАК НаименованиеПолное,
	|	Спр.ФИО КАК ФИО,
	|	Спр.ИНН КАК ИНН,
	|	Спр.КПП КАК КПП,
	|	Спр.КодПоОКПО КАК КодПоОКПО,
	|	"""" КАК ОГРН,
	|	ЗНАЧЕНИЕ(Перечисление.дт_ТипыКлиентов.ЮрЛицо) КАК ЮрФизЛицо,
	|	Спр.ЮридическийАдрес КАК ЮридическийАдрес,
	|	Спр.ФактическийАдрес КАК ФактическийАдрес,
	|	Спр.Телефон КАК Телефоны,
	|	Спр.Страна2 КАК СтранаДоставки,
	|	Спр.Область КАК РегионДоставки,
	|	Спр.Город2 КАК ГородДоставки,
	|	"""" КАК Паспорт,
	|	"""" КАК Прописка,
	|	Спр.Email КАК Email
	|ИЗ
	|	Справочник.Контрагенты КАК Спр
	|ГДЕ
	|	Спр.Ссылка = &Контрагент");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = Новый Структура("Представление,Наименование,НаименованиеПолное,ИНН,КПП,КодПоОКПО,ОГРН,ЮрФизЛицо,ЮридическийАдрес,ФактическийАдрес,Телефоны,АдресДоставки,Паспорт,Прописка,Email");
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		
		Наименование	= Выборка.НаименованиеПолное;
		
		СтруктураРеквизитов.Представление = Выборка.НаименованиеПолное;
		СтруктураРеквизитов.Наименование = Выборка.НаименованиеПолное;
		
		Если ОбщегоНазначенияУТКлиентСервер.ЭтоИП(Выборка.ЮрФизЛицо) 
			И Не ЗначениеЗаполнено(СтруктураРеквизитов.Наименование) Тогда
			СтруктураРеквизитов.Наименование = "Индивидуальный предприниматель " + Выборка.ФИО;
		КонецЕсли;
		
		СтруктураРеквизитов.НаименованиеПолное = СтруктураРеквизитов.Наименование;
		
		СтруктураРеквизитов.АдресДоставки = ФормированиеПечатныхФорм.АдресДоставки(Выборка);	
	КонецЕсли;
	
	
	Возврат СтруктураРеквизитов;

КонецФункции 


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли


#Область ПоискПоИннИНаименованию

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПоисковаяСтрока", "%" + Параметры.СтрокаПоиска + "%");
	Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка
		|
		|ИЗ
		|	Справочник.Контрагенты
		|
		|ГДЕ
		|	ИНН ПОДОБНО &ПоисковаяСтрока
		|	ИЛИ Наименование ПОДОБНО &ПоисковаяСтрока
		|
		|";
	
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
    ДанныеВыбора = Новый СписокЗначений;
    ДанныеВыбора.ЗагрузитьЗначения(Массив);
    СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
